#Task 1
# Порахувати кількість унікальних символів в строці. Якщо їх більше 10 - вивести в консоль True, інакше - False. Строку отримати за допомогою функції input()
#Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#Ви можете перевірити це в інкогніто-режимі вашого браузера.
#Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

proposed_string: str = input("Provide your string hereplease:  ")
unsque_counter: int = sum([1 for char in proposed_string if proposed_string.count(char) == 1])
print(unsque_counter)
if unsque_counter > 10:
    print(True)
else:
    print(False)

#task 2
#Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі). Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".
#Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#Ви можете перевірити це в інкогніто-режимі вашого браузера.
#Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

is_correct_str: bool = False

while not is_correct_str:
    provider_word: str = input("Provsde your word please: ").lower()

    if provider_word.find("h")!= -1:
        is_correct_str = True

#task 3
#Є list з даними lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']. Напишіть код, який свормує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1. Данні в лісті можуть бути будь якими
#Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#Ви можете перевірити це в інкогніто-режимі вашого браузера.
#Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

list1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
desired_list: list[str] = [item for item in list1 if isinstance(item, str)]

print(desired_list)

#task 4
#Є ліст з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому лісті
#Перевірте, що репозиторій в git є публічним або ваш вчитель доданий до цього репозиторію.
#Ви можете перевірити це в інкогніто-режимі вашого браузера.
#Просто вставте посилання на свій репозиторій та переконайтеся, що ви можете побачити код.

provided_list_1: list[int] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result: int = sum([integer for integer in provided_list_1 if integer % 2 == 0])
print(result)
